# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line

create_library_set -name timing_lib -timing {/home/abhinav23024/Desktop/RISCV5/slow.lib}
create_constraint_mode -name sdc_1 -sdc_files {/home/abhinav23024/Desktop/RISCV5/dft_constraints.sdc}

create_delay_corner -name delay_1 -early_library_set {timing_lib} -late_library_set {timing_lib} 

create_analysis_view -name view_1 -constraint_mode {sdc_1} -delay_corner {delay_1}

set_analysis_view -setup {view_1} -hold {view_1}
